LEXICON: dict[str, str] = {
    '/help': '@killazius - пиши скорее,если <b>ты нашел баг/недочет в боте</b>, '
             'либо просто хочешь подкинуть мне идею',
    '/start': 'Привет! Тебя приветствует <i>FACEIT STATS BOT</i>\n'
              'Я бот, который поможет тебе отслеживать твою статистику.\n'
              '<b>Жду твоих команд!</b>',
    '/info': 'Этот бот создан для того, чтобы отслежить статистику пользователей на <b>FACEIT</b>\n'
             'Бот работает в тестовом режиме и пока не имеет каких либо функций, но вскоре он будет корректно работать',
    '/stats': 'Статистика {nickname} в игре Counter Strike 2\n'
              'LEVEL - {level}\n'
              'ELO - {elo}'

}

LEXICON_COMMANDS: dict[str, str] = {
    '/help': 'Написать разработчику',
    '/stats': 'Посмотреть статистику игрока в игре CS2',
    '/info': 'Информация о боте'

}
